[
{"link": "https://www.postgraduate.study.cam.ac.uk/courses/directory/poafmpafs", "title": "MPhil in African Studies", "study_level": "Postgraduate", "qualification": "Master of Philosophy", "university_title": "University of Cambridge", "description": "'The MPhil in African Studies offers a taught course with a substantial research component and provides an excellent foundation for students wanting to develop their knowledge of Africa. It is designed for students who wish to enhance their historical and contemporary understanding of Africa’s societies, politics, economics, and cultures, as well as for those who wish to apply for advanced research degrees. The degree thus offers a highly regarded postgraduate qualification relevant to a wide range of professional careers, as well as intensive research and language training for students planning to prepare a doctoral dissertation.'", "about": "By the end of the course, students should have acquired: a deeper knowledge and understanding of African studies and its critical debates; a conceptual and contextual understanding enabling the evaluation of past and present research on Africa and its methodologies; the knowledge and technical skills required for pursuing original research in their chosen area; the ability to situate their own research within current and past methodological and interpretative developments in the field; and increased proficiency in speaking an African language or language spoken in Africa, and/or in using an African language or language spoken in Africa for academic purposes.", "application_open_dates": "Sept. 15, 2022", "application_close_dates": "Feb. 28, 2023", "start_dates": "Oct. 1, 2023", "things_needed_to_apply": "Two academic references, Transcript, CV/resume, Evidence of competence in English, Research proposal (M), Sample of work (1), Gates Cambridge Reference, Research Proposal (PhD applicants only)", "tuition": [{"fee_status": "Home", "total_annual_commitment": "£29,301"}], "entry_requirements": "Applications are welcome from British, EU and international graduate students. Minimum qualifications are a good 2.1 honours degree and an excellent command of English. All candidates for admission to the MPhil are expected to be of PhD potential and to have degree results in at least the top quarter of the graduating cohort at their previous university.", "language_requirements": [{"language": "English", "test": "IELTS (Academic)", "score": "Listening: 7.0, Writing: 7.0, Reading: 7.0, Speaking: 7.0, Total: 7.5"}, {"language": "English", "test": "TOEFL Internet Score", "score": "Listening: 25, Writing: 25, Reading: 25, Speaking: 25, Total: 110"}, {"language": "English", "test": "CAE", "score": "Grade A or B (with at least 193 in each individual element) plus a language centre assessment."}, {"language": "English", "test": "CPE", "score": "Grade A, B, or C (with at least 200 in each individual element)."}], "locations": "University of Cambridge, The Old Schools, Trinity Lane, Cambridge, CB2 1TN, United Kingdom"}
]